Revit 2027 API
BuiltInFailures.PerformanceFailures.ViewDetailLevelIsHighInLargeView Property
 A large view has view detail level set to medium or coarse. Generation of extraneous details harms performance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewDetailLevelIsHighInLargeView { get; }
Public Shared ReadOnly Property ViewDetailLevelIsHighInLargeView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewDetailLevelIsHighInLargeView {
	FailureDefinitionId^ get ();
}
static member ViewDetailLevelIsHighInLargeView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace